[
    {
        "title":"Tips for learning Deliberately",
        "intro":"",
        "listOfBulletPoints":[
            {
                "title":"Code Daily",
                "bulletContent":"The number one way to learn anything is to practice frequently. "
            },
            {
                "title":"Code with Intent, Have a Plan of Action",
                "bulletContent":"Intent means planning what you will be coding and what is the end result so you are not wasting time wondering what is next. "
            },
            {
                "title":"Iterate, Iterate, Iterate. ",
                "bulletContent":"Refactor or rebuild something you have done in the past helps cement what you learned in your mind and practice writing good clean efficient code."
            }
        ],
        "isfeature": true
    },
    {
        "title":"You are only as great as your support system",
        "intro":"When I was raising cucumbers, I learned it's best to scaffold a trellis to support the long vines and growing buds. I harvested more cucumbers and they were bigger. The correlation is your career needs support to grow. Success does not happen in a vacuum. You need:",
        "listOfBulletPoints":[
            {
                "title":"Mentors",
                "bulletContent":""
            },
            {
                "title":"Coding buddies to listen as you 'rubber duck' problems",
                "bulletContent":""
            },
            {
                "title":"Mock interviewers & resume reviewers",
                "bulletContent":""
            },
            {
                "title":"Supporters to help you find a job and even more important; to speak good about you when you are not in the room.",
                "bulletContent":""
            }
        ],
        "isfeature": false
    },
    {
        "title":"Don't underestimate the power of networking",
        "intro":"Job hunting can seem like a black hole sucking up every job application you submit. Networking can and should be an essential part of connecting your face, name, or reputation to a job application. Resources to use:",
        "listOfBulletPoints":[
            {
                "title":"LinkedIn",
                "bulletContent":""
            },
            {
                "title":"Twitter",
                "bulletContent":""
            },
            {
                "title":"Tech meetups",
                "bulletContent":""
            },
            {
                "title":"Slack communities",
                "bulletContent":""
            },
            {
                "title":"Discord server communities",
                "bulletContent":""
            }
        ],
        "isfeature": false
    }
]